In [349]:
import pandas as pd
import numpy as np

In [350]:
df=pd.DataFrame(data=np.random.randint(0,10,size=(3,4)),columns=list('ABCD'))
df

   A  B  C  D
0  9  4  9  5
1  3  0  7  5
2  3  7  7  9

In [351]:
df+10

    A   B   C   D
0  19  14  19  15
1  13  10  17  15
2  13  17  17  19

In [352]:
arr1=np.array([1,2,3,4])
arr1

array([1, 2, 3, 4])

In [353]:
df+arr1

    A  B   C   D
0  10  6  12   9
1   4  2  10   9
2   4  9  10  13

In [354]:
s=pd.Series(data=[1,2,3,4],index=list('ABCD'))
s

A    1
B    2
C    3
D    4
dtype: int64

In [355]:
df

   A  B  C  D
0  9  4  9  5
1  3  0  7  5
2  3  7  7  9

In [356]:
df+s

    A  B   C   D
0  10  6  12   9
1   4  2  10   9
2   4  9  10  13

In [357]:
s1=pd.Series(data=[1,2,3,4],index=[1,2,3,4])
s1

1    1
2    2
3    3
4    4
dtype: int64

In [358]:
df+s1

    A   B   C   D   1   2   3   4
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN

In [359]:
df

   A  B  C  D
0  9  4  9  5
1  3  0  7  5
2  3  7  7  9

In [360]:
s=pd.Series(data=[1,2,3],index=[0,1,2])
s

0    1
1    2
2    3
dtype: int64

In [361]:
df.add(s, axis='index')

    A   B   C   D
0  10   5  10   6
1   5   2   9   7
2   6  10  10  12

In [362]:
df1=pd.DataFrame(data=np.random.randint(0,10,size=(3,3)),columns=list('ABC'))
df2=pd.DataFrame(data=np.random.randint(0,10,size=(2,2)),columns=list('BA'))
display(df1,df2)

   A  B  C
0  5  0  9
1  2  2  3
2  9  4  7

   B  A
0  6  9
1  6  7

In [363]:
df1+df2

      A    B   C
0  14.0  6.0 NaN
1   9.0  8.0 NaN
2   NaN  NaN NaN

In [364]:
df1.add(df2,fill_value=0)

      A    B    C
0  14.0  6.0  9.0
1   9.0  8.0  3.0
2   9.0  4.0  7.0

### 代码解释
这段代码使用 pandas 的 `add` 方法对两个 `DataFrame` 对象 `df1` 和 `df2` 进行元素级相加操作。
由于 `df1` 和 `df2` 的形状和索引不完全匹配，`add` 方法通过参数 `fill_value=0` 指定在缺失值的位置填充为 0。
最终的结果是将两个 `DataFrame` 中对应位置的值相加，缺失值用 0 替代。